---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainer.PresentItemsAsSubelements
source: html/a949781c-f4be-54bf-6f74-52dff40b28f7.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.PresentItemsAsSubelements Property

Identifies if Items should be presented in schedules and tags as separate subelements.

## Syntax (C#)
```csharp
public bool PresentItemsAsSubelements { get; set; }
```